1  Five functions of pandas are :

i) read_csv

In [3]:
import pandas as pd
df = pd.read_csv('sample.csv')
df

,countyName,stateName,countyFIPS,stateFIPS,#vets,#SCDvets,#Ineligible_vets,#Caregivers,all_Services<30,all_Services30-60,...,ARNG<30SCD,ARNG30-60SCD,ARNG>60SCD,ARNG<30IE,ARNG30-60IE,ARNG>60IE,ARNG<30Care,ARNG30-60Care,ARNG>60Care,Total
0,Sumter,Alabama,119,1,13763,0,0,0,3968,9795,...,0,0,0,0,0,0,0,0,0,13763
1,Sumter,Florida,119,12,93420,0,0,0,91350,2070,...,0,0,0,0,0,0,0,0,0,93420

ii) read_excel

In [5]:
df1 = pd.read_excel('practice.xls')
df1.head()

   0 First Name  Last Name  Gender        Country  Age        Date    Id
0  1      Dulce      Abril  Female  United States   32  15/10/2017  1562
1  2       Mara  Hashimoto  Female  Great Britain   25  16/08/2016  1582
2  3     Philip       Gent    Male         France   36  21/05/2015  2587
3  4   Kathleen     Hanner  Female  United States   25  15/10/2017  3549
4  5    Nereida    Magwood  Female  United States   58  16/08/2016  2468

iii) dtypes

In [10]:
df.dtypes

countyName       object
stateName        object
countyFIPS        int64
stateFIPS         int64
#vets             int64
                  ...
ARNG>60IE         int64
ARNG<30Care       int64
ARNG30-60Care     int64
ARNG>60Care       int64
Total             int64
Length: 189, dtype: object

iv) descibe

In [15]:
df2 = df1.head()
df2.describe

<bound method NDFrame.describe of    0 First Name  Last Name  Gender        Country  Age        Date    Id
0  1      Dulce      Abril  Female  United States   32  15/10/2017  1562
1  2       Mara  Hashimoto  Female  Great Britain   25  16/08/2016  1582
2  3     Philip       Gent    Male         France   36  21/05/2015  2587
3  4   Kathleen     Hanner  Female  United States   25  15/10/2017  3549
4  5    Nereida    Magwood  Female  United States   58  16/08/2016  2468>

v) Drop

In [19]:
df1.drop("Gender" , axis = 1, inplace = True)

2.

In [51]:
#Here is the dataframe which have column A,B,C
data = {"A" : [1,2,3,4] , 
        "B" : [5,6,7,8],
        "C" : [6,4,45,6]}
d1 = pd.DataFrame(data)
d1

   A  B   C
0  1  5   6
1  2  6   4
2  3  7  45
3  4  8   6

In [52]:
#Now reindexing
new_index = []
for i in range(1, 2*len(d1)+1 , 2):
    new_index.append(i)
d1.reindex(new_index)

     A    B    C
1  2.0  6.0  4.0
3  4.0  8.0  6.0
5  NaN  NaN  NaN
7  NaN  NaN  NaN

3.

In [5]:
data = {"values" : [20,30,80,10,60]}

In [16]:
df = pd.DataFrame(data)
sum_values = df["values"].iloc[:3].sum()
sum_values

130

4.

In [25]:
data = {"Text" : ["Taher" , "Ali" , "Bohra"]} #Creating the data

In [26]:
df = pd.DataFrame(data)                              
df["Word_count"] = df["Text"].apply(lambda x: len(x))             #Now here I'm defining 1 new column of words count
df

    Text  Word_count
0  Taher           5
1    Ali           3
2  Bohra           5

5.

Dataframe.size() returns the total number of elements in the DataFrame.
For example

In [29]:
data = {"a" : [1,2,3,4] , 
        "b" : [5,6,7,8]}
df = pd.DataFrame(data)
df.size

8

The DataFrame.shape() attribute returns a tuple representing the dimensions of the DataFrame, i.e., the number of rows and the number of columns.

In [30]:
df.shape

(4, 2)

6. "pd.read_excel" we use for reading the excel files in pandas

7.

In [31]:
data = {"Email" : ['taherbohra06@gmail.com' , 'taanrbwk828@gmail.com' , 'bohra68@gmail.com' , 'hero45@gmail.com']}

In [34]:
df = pd.DataFrame(data)
df['username'] = df['Email'].str.split('@').str[0]
df

                    Email      username
0  taherbohra06@gmail.com  taherbohra06
1   taanrbwk828@gmail.com   taanrbwk828
2       bohra68@gmail.com       bohra68
3        hero45@gmail.com        hero45

8.

In [1]:
import pandas as pd

In [3]:
data = {"A" : [3,8,6,2,9] , 
        "B" : [5,2,9,3,1] , 
        "C" : [1,7,4,5,2] }
df = pd.DataFrame(data)
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [9]:
df[(df["A"] > 5 )& (df["B"] < 10)]

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

9.

In [10]:
df = pd.DataFrame({"Values" : [23, 45, 34, 53, 34, 43]})
df

   Values
0      23
1      45
2      34
3      53
4      34
5      43

In [14]:
df.mean()    #Mean

Values    38.666667
dtype: float64

In [15]:
df.median() #Median

Values    38.5
dtype: float64

In [16]:
df.std() #Standard Deviation

Values    10.519823
dtype: float64

10.

In [20]:
data = {"Sales" : [10000 , 5000 , 4000 , 9000 , 3000 , 6000 , 3000 , 5000 , 7000 , 5000 ] ,
        "Dates" : pd.date_range(start='2024-01-01', periods=10, freq='D')}
df = pd.DataFrame(data)
df

   Sales      Dates
0  10000 2024-01-01
1   5000 2024-01-02
2   4000 2024-01-03
3   9000 2024-01-04
4   3000 2024-01-05
5   6000 2024-01-06
6   3000 2024-01-07
7   5000 2024-01-08
8   7000 2024-01-09
9   5000 2024-01-10

In [23]:
df['MovingAverage']  = df['Sales'].rolling(window = 7).apply(lambda x : x.mean())
df

   Sales      Dates  MovingAverage
0  10000 2024-01-01            NaN
1   5000 2024-01-02            NaN
2   4000 2024-01-03            NaN
3   9000 2024-01-04            NaN
4   3000 2024-01-05            NaN
5   6000 2024-01-06            NaN
6   3000 2024-01-07    5714.285714
7   5000 2024-01-08    5000.000000
8   7000 2024-01-09    5285.714286
9   5000 2024-01-10    5428.571429

11.

In [26]:
df = pd.DataFrame({"Date" : pd.date_range(start = '2024-02-01' , periods = 9 , freq = 'D')})
df

        Date
0 2024-02-01
1 2024-02-02
2 2024-02-03
3 2024-02-04
4 2024-02-05
5 2024-02-06
6 2024-02-07
7 2024-02-08
8 2024-02-09

In [28]:
df['Weekdays'] = df['Date'].dt.day_name()
df

        Date   Weekdays
0 2024-02-01   Thursday
1 2024-02-02     Friday
2 2024-02-03   Saturday
3 2024-02-04     Sunday
4 2024-02-05     Monday
5 2024-02-06    Tuesday
6 2024-02-07  Wednesday
7 2024-02-08   Thursday
8 2024-02-09     Friday

12.

In [29]:
import pandas as pd
data = {'Date': pd.to_datetime(['2023-01-01', '2023-01-05', '2023-01-15', '2023-01-20','2023-02-01', '2023-01-30', '2023-03-01']),
        'Value': [10, 20, 30, 40, 50, 60, 70]}
df = pd.DataFrame(data)
filtered_df = df[(df['Date'] >= '2023-01-01') & (df['Date'] <= '2023-01-31')]
print(filtered_df)

        Date  Value
0 2023-01-01     10
1 2023-01-05     20
2 2023-01-15     30
3 2023-01-20     40
5 2023-01-30     60

13.

The first and foremost library that needs to be imported to use the basic functions of pandas is the "import pandas as pd"